app/Controllers/ArsipController.php

SELECT *
FROM `jenis_surat`
---
    public function surat($id): string
    {
        if (!session()->get('loggedIn')) {
            return redirect()->to('login')->with('error', 'Please login first.');
        }
        $jenisSuratModel = new Jenis_model();
        // Pass the surat ID to the view
        $data = [
            'title' => 'Arsip Surat',
            'content' => 'Arsip/arsip_data',
            'selected_surat_id' => $id,
            'jenis_surat' => $jenisSuratModel->findAll()